'''Робот может перемещаться в четырех направлениях
(«С» — север, «З» — запад, «Ю» — юг, «В» — восток)
и принимать три цифровые команды:
0 — продолжать движение,
1 — поворот налево,
−1 — поворот направо.
Дан символ C — исходное направление робота и целое число N — посланная ему команда.
Вывести направление робота после выполнения полученной команды.'''

lst = ['С', 'Ю', 'З', 'В']
C, N = input().split()
N = int(N)

indexC = lst.index(C)

match N:
    case 1:
        result = (indexC + 1) % 4
    case -1:
        result = (indexC - 1) % 4
    case _:
        result = indexC

print(f'Результат: {lst[result]}')





